import time


def streat_text_agent():
    full_text = """
    -🔎 Ищет информацию на фриланс-рынках \n
    -📊 Анализирует спрос,конкуренцию,цену и так далее \n
    -✏️ Имеет структурированных ответ \n
    -💰 Полностью бесплатный \n
    -⚡ Быстрый и точный 
    """

    for word in full_text.split(" "):
        yield word + " "
        time.sleep(0.03)


def streat_text_how_work():
    full_text = """
    - 1.Получите Gemini API Key или HuggingFace API Key \n
    - 2.Перейдите в **Настройки** \n
    - 3.Вставьте Gemini API Key или HuggingFace API Key \n
    - 4.Выберите модель Gemini или HuggingFace \n
    - 5.Сохраните настройки \n
    - 6.Перейдите в **Агент** \n
    - 7.Введите тему \n
    - 8.Нажмите на кнопку **Начать поиск** \n

    Если вы всё сделали правильно у вас будет ответ от агента
    """

    for word in full_text.split(" "):
        yield word + " "
        time.sleep(0.03)


def streat_text_technology():
    full_text = """
    ### 📟Backend \n
    - LangChain \n
    - Модели Gemini \n
    - Web-Search \n

    ### 📋Frontend \n
    - Streamlit
    """

    for word in full_text.split(" "):
        yield word + " "
        time.sleep(0.03)


def streat_text_people():
    full_text = """
    - Фрилансеры
    - Стартаперы
    - Аналитики рынков
    """

    for word in full_text.split(" "):
        yield word + " "
        time.sleep(0.03)


def streat_text_how_work_agent():
    full_text = """
    - 1.Заполните **Настройки**
    - 2.Впишите на боковой панели тему
    - 3.Нажмите на кнопку **Начать работу агента**
    - 4.Подождите
    - 5.После получение ответа можете читать
    """

    for word in full_text.split(" "):
        yield word + " "
        time.sleep(0.03)
